In [4]:
import pandas as pd
import MySQLdb

In [52]:
connection = MySQLdb.connect(
    'localhost',
    'root',
    '1234',
    charset='utf8'
)

In [53]:
cursor = connection.cursor()

In [54]:
sql = '''
    show databases;
'''

cursor.execute(sql)

17

In [55]:
# 데이터베이스 생성 - budongsan
sql = '''
    create database budongsan;
'''

cursor.execute(sql)

1

In [57]:
sql ='''
    show databases;
'''

cursor.execute(sql)

18

In [58]:
cursor.fetchall()

(('information_schema',),
 ('budongsan',),
 ('company',),
 ('compressdb',),
 ('employees',),
 ('mysql',),
 ('mytestdb',),
 ('performance_schema',),
 ('quiz',),
 ('sakila',),
 ('sales',),
 ('sqldb',),
 ('sys',),
 ('tabledb',),
 ('testdb',),
 ('triggerdb',),
 ('webdb',),
 ('world',))

In [81]:
# budongsan db에 연결
budongsan_db = MySQLdb.connect(
    'localhost',
    'root',
    '1234',
    'budongsan',
    charset='utf8'
)

In [82]:
cursor = budongsan_db.cursor()

In [83]:
cursor.execute('show tables')

2

In [64]:
# name, address, height, email
sql = '''
    create table myTbl(
        name varchar(10),
        address varchar(10),
        height int,
        email varchar(20)
    )
'''

cursor.execute(sql)

0

In [66]:
sql = '''
    insert into myTbl values ('kkk', 'abc', 123, 'ovov@naa')
'''

cursor.execute(sql)

1

In [69]:
df = pd.read_csv('budongsan.csv')
df.head()

,Unnamed: 0,매물번호,연락처,주소,부동산,보증금,월세
0,0,3467204.0,010-123-4567,서울시 강남구 역삼동 0,TODAY공인중개사(이인규),1000.0,100.0
1,1,3150497.0,010-123-4567,서울시 강남구 역삼동 1,TODAY공인중개사(이인규),11000.0,60.0
2,2,3440906.0,010-123-4567,서울시 강남구 역삼동 2,열린공인중개사(강광수),5000.0,65.0
3,3,3376834.0,010-123-4567,서울시 강남구 역삼동 3,미래공인중개사(김유철),3000.0,95.0
4,4,3331511.0,010-123-4567,서울시 강남구 역삼동 4,한백부동산공인중개사(김남조),110.0,110.0

In [90]:
df = df.drop('Unnamed: 0', axis = 1)

In [86]:
# df의 데이터를 mysql 에 넣어주기 위한 모듈
# create_engine / mysql.connector
import mysql.connector
from sqlalchemy import create_engine

In [91]:
# df의 데이터를 mysql db에 넣어준다.

engine = create_engine('mysql+mysqlconnector://root:1234@localhost:3306/budongsan', echo=False)
df.to_sql(name='for_sale', con=engine, if_exists = 'replace', index=False)
# to_sql (name : 테이블명, con : 연결된 engin, 
# if_exists : 같은 이름의 테이블이 존재할 경우(replace : 삭제 후 새로, append : 뒤에 추가, fail : 실패)
# index : df의 인덱스를 그대로 사용할 것 인지

In [92]:
sql = '''
    create table room(
        addr varchar(225),
        agend varchar(225),
        deposit int,
        rent int
    )
'''

cursor.execute(sql)

0

In [102]:
# for 문을 사용한 방법
# 원하는 값만을 받아서 db에 저장할 수 있다.
for i in range(len(df)):
    addr = df.iloc[i][2]
    agent = df.iloc[i][3]
    deposit = df.iloc[i][4]
    rent = df.iloc[i][5]
    
    sql = '''
        insert into room values('{addr}', '{agent}', {deposit}, {rent})
    '''.format(addr = addr, agent = agent, deposit = deposit, rent = rent)
    
    cursor.execute(sql)
budongsan_db.commit()

In [103]:
sql = '''
    select * from room;
'''

cursor.execute(sql)

43

In [104]:
cursor.fetchall()

(('서울시 강남구 역삼동 0', 'TODAY공인중개사(이인규)', 1000, 100),
 ('서울시 강남구 역삼동 1', 'TODAY공인중개사(이인규)', 11000, 60),
 ('서울시 강남구 역삼동 2', '열린공인중개사(강광수)', 5000, 65),
 ('서울시 강남구 역삼동 3', '미래공인중개사(김유철)', 3000, 95),
 ('서울시 강남구 역삼동 4', '한백부동산공인중개사(김남조)', 110, 110),
 ('서울시 강남구 역삼동 5', '강남코리아공인중개사(기숙영)', 15000, 70),
 ('서울시 강남구 역삼동 6', '열린공인중개사(강광수)', 1000, 85),
 ('서울시 강남구 역삼동 7', '한강공인중개사(김상헌)', 1000, 80),
 ('서울시 강남구 역삼동 8', '동하공인중개사(임성우)', 1000, 60),
 ('서울시 강남구 역삼동 9', '스타공인중개사(박정직)', 2000, 50),
 ('서울시 강남구 역삼동 10', 'HS강남공인중개사(김현수)', 1000, 96),
 ('서울시 강남구 역삼동 11', 'H공인중개사(김용만)', 15000, 70),
 ('서울시 강남구 역삼동 12', '도원공인중개사(손석진)', 65, 65),
 ('서울시 강남구 역삼동 13', '강남우리공인중개사(어정화)', 2000, 150),
 ('서울시 강남구 역삼동 14', '청록공인중개사(하순자)', 3000, 60),
 ('서울시 강남구 역삼동 15', '커피한잔공인중개사(손별)', 500, 67),
 ('서울시 강남구 역삼동 16', '강남코리아공인중개사(기숙영)', 15000, 60),
 ('서울시 강남구 역삼동 17', 'TODAY공인중개사(이인규)', 5000, 50),
 ('서울시 강남구 역삼동 18', '나무공인중개사(조민영)', 90, 90),
 ('서울시 강남구 역삼동 19', '한강공인중개사(김상헌)', 300, 80),
 ('서울시 강남구 역삼동 20', 'TODAY공인중개사(이인규)', 5000, 60),
 ('서울시 강남구 역삼동 21', '한백부동산공인중개사(김남조)', 75, 75),
 ('서울시 강남구 역삼동 22', '강남코리아공인중개사(기숙영)', 1000, 65),
 ('서울시 강남구 역삼동 23', '도원공인중개사(손석진)', 65, 65),
 ('서울시 강남구 역삼동 24', 'TODAY공인중개사(이인규)', 1000, 60),
 ('서울시 강남구 역삼동 25', '아셈타운공인중개사(임현옥)', 7000, 100),
 ('서울시 강남구 역삼동 26', '강남코리아공인중개사(기숙영)', 2000, 63),
 ('서울시 강남구 역삼동 27', '웰컴공인중개사(이영진)', 1000, 120),
 ('서울시 강남구 역삼동 28', '건우공인중개사(김상모)', 70, 70),
 ('서울시 강남구 역삼동 29', 'NB공인중개사(길주현)', 1000, 70),
 ('서울시 강남구 역삼동 30', '부동산네트워크공인중개사(황창문)', 8000, 55),
 ('서울시 강남구 역삼동 31', '도원공인중개사(손석진)', 68, 68),
 ('서울시 강남구 역삼동 32', '스타공인중개사(박정직)', 4000, 40),
 ('서울시 강남구 역삼동 33', '대청공인중개사(이선영)', 14000, 70),
 ('서울시 강남구 역삼동 34', '한백부동산공인중개사(김남조)', 10000, 100),
 ('서울시 강남구 역삼동 35', '스타공인중개사(박정직)', 6000, 50),
 ('서울시 강남구 역삼동 36', '정성공인중개사(정문식)', 100, 100),
 ('서울시 강남구 역삼동 37', 'TODAY공인중개사(이인규)', 3000, 100),
 ('서울시 강남구 역삼동 38', '미래공인중개사(김유철)', 1000, 85),
 ('서울시 강남구 역삼동 39', '한백부동산공인중개사(김남조)', 75, 75),
 ('서울시 강남구 역삼동 40', '강남코리아공인중개사(기숙영)', 1000, 63),
 ('서울시 강남구 역삼동 41', '친절한공인중개사(김천호)', 500, 65),
 ('서울시 강남구 역삼동 42', '강남코리아공인중개사(기숙영)', 3000, 75))

In [ ]:
# sakila db
# 렌탈 횟수가 30회 이상인 유저(rental, customer)
# 유저 이름, 유저 이메일

In [105]:
# sakila db에 연결
sakila_db = MySQLdb.connect(
    'localhost',
    'root',
    '1234',
    'sakila',
    charset='utf8'
)

In [108]:
# DataFrame
sql = ''' select * from customer; '''
customer_df = pd.read_sql(sql, sakila_db)
sql = ''' select * from rental; '''
rental_df = pd.read_sql(sql, sakila_db)

In [111]:
customer_df.head(1)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [112]:
rental_df.head(1)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53

In [115]:
cust_rent_df = pd.merge(customer_df, rental_df, on='customer_id')

In [146]:
df30 = cust_rent_df.groupby('customer_id')['rental_id'].count() > 30

In [148]:
idx30 = [ idx for idx, i in enumerate(df30) if i == True]

In [155]:
cust_rent_df = cust_rent_df[['first_name', 'email', 'customer_id']]

unique_df = cust_rent_df.drop_duplicates(['customer_id'], keep = 'last')

In [156]:
unique_df.head(1)

   first_name                          email  customer_id
31       MARY  MARY.SMITH@sakilacustomer.org            1

In [159]:
unique_df.set_index('customer_id', drop = True).iloc[idx30]

             first_name                                     email
customer_id
1                  MARY             MARY.SMITH@sakilacustomer.org
5             ELIZABETH        ELIZABETH.BROWN@sakilacustomer.org
7                 MARIA           MARIA.MILLER@sakilacustomer.org
15                HELEN           HELEN.HARRIS@sakilacustomer.org
21             MICHELLE         MICHELLE.CLARK@sakilacustomer.org
26              JESSICA           JESSICA.HALL@sakilacustomer.org
27              SHIRLEY          SHIRLEY.ALLEN@sakilacustomer.org
28              CYNTHIA          CYNTHIA.YOUNG@sakilacustomer.org
29               ANGELA       ANGELA.HERNANDEZ@sakilacustomer.org
30              MELISSA           MELISSA.KING@sakilacustomer.org
35             VIRGINIA         VIRGINIA.GREEN@sakilacustomer.org
38               MARTHA        MARTHA.GONZALEZ@sakilacustomer.org
46            CATHERINE     CATHERINE.CAMPBELL@sakilacustomer.org
50                DIANE          DIANE.COLLINS@sakilacustomer.org
51                ALICE          ALICE.STEWART@sakilacustomer.org
64               JUDITH             JUDITH.COX@sakilacustomer.org
66               JANICE            JANICE.WARD@sakilacustomer.org
75                TAMMY          TAMMY.SANDERS@sakilacustomer.org
78                 LORI              LORI.WOOD@sakilacustomer.org
84                 SARA             SARA.PERRY@sakilacustomer.org
86           JACQUELINE        JACQUELINE.LONG@sakilacustomer.org
89                JULIA           JULIA.FLORES@sakilacustomer.org
91                 LOIS            LOIS.BUTLER@sakilacustomer.org
102             CRYSTAL           CRYSTAL.FORD@sakilacustomer.org
103              GLADYS        GLADYS.HAMILTON@sakilacustomer.org
114               GRACE            GRACE.ELLIS@sakilacustomer.org
119              SHERRY        SHERRY.MARSHALL@sakilacustomer.org
120              SYLVIA           SYLVIA.ORTIZ@sakilacustomer.org
122              THELMA          THELMA.MURRAY@sakilacustomer.org
125               ETHEL             ETHEL.WEBB@sakilacustomer.org
...                 ...                                       ...
416             JEFFERY         JEFFERY.PINSON@sakilacustomer.org
438               BARRY         BARRY.LOVELACE@sakilacustomer.org
439           ALEXANDER      ALEXANDER.FENNELL@sakilacustomer.org
442               LEROY       LEROY.BUSTAMANTE@sakilacustomer.org
446            THEODORE          THEODORE.CULP@sakilacustomer.org
451                 JIM                JIM.REA@sakilacustomer.org
452                 TOM             TOM.MILNER@sakilacustomer.org
454                ALEX           ALEX.GRESHAM@sakilacustomer.org
459               TOMMY          TOMMY.COLLAZO@sakilacustomer.org
462              WARREN         WARREN.SHERROD@sakilacustomer.org
468                 TIM               TIM.CARY@sakilacustomer.org
469              WESLEY            WESLEY.BULL@sakilacustomer.org
470              GORDON          GORDON.ALLARD@sakilacustomer.org
473               JORGE         JORGE.OLIVARES@sakilacustomer.org
479             ZACHARY           ZACHARY.HITE@sakilacustomer.org
494               RAMON           RAMON.CHOATE@sakilacustomer.org
502               BRETT         BRETT.CORNWELL@sakilacustomer.org
503               ANGEL          ANGEL.BARCLAY@sakilacustomer.org
506              LESLIE          LESLIE.SEWARD@sakilacustomer.org
513               DUANE            DUANE.TUBBS@sakilacustomer.org
520            MITCHELL  MITCHELL.WESTMORELAND@sakilacustomer.org
522              ARNOLD          ARNOLD.HAVENS@sakilacustomer.org
526                KARL              KARL.SEAL@sakilacustomer.org
532                NEIL            NEIL.RENNER@sakilacustomer.org
533              JESSIE           JESSIE.MILAM@sakilacustomer.org
535              JAVIER           JAVIER.ELROD@sakilacustomer.org
550                 GUY           GUY.BROWNLEE@sakilacustomer.org
566               CASEY             CASEY.MENA@sakilacustomer.org
569                DAVE          DAVE.GARDINER@sakilacustomer.org
576              MORRIS        MORRIS.MCCARTER@sakilacustomer.org

[134 rows x 2 columns]

In [164]:
# SQL
sql = '''
    select c.first_name, c.email, count(*) as total_rental
    from rental r 
         inner join customer c
    where r.customer_id = c.customer_id
    group by (r.customer_id)
    having count(*) >= 30;
'''

pd.read_sql(sql, sakila_db).head()

  first_name                               email  total_rental
0       MARY       MARY.SMITH@sakilacustomer.org            32
1  ELIZABETH  ELIZABETH.BROWN@sakilacustomer.org            38
2      MARIA     MARIA.MILLER@sakilacustomer.org            33
3      HELEN     HELEN.HARRIS@sakilacustomer.org            32
4     SHARON  SHARON.ROBINSON@sakilacustomer.org            30

In [ ]:
# sakila
# film 테이블에서 2006년이나 2007년에 출시되었으면서
# PG 등급이거나 G등급의 영화 제목

In [166]:
# DataFrame
sql = '''
    select * from film
'''

film_df = pd.read_sql(sql, sakila_db)

In [185]:
film_df[['title', 'rating', 'release_year']] \
        [((film_df['rating'] == 'G') | (film_df['rating'] == 'PG')) & \
        ((film_df['release_year'] == 2006) | (film_df['release_year'] == 2007))].head()

              title rating  release_year
0  ACADEMY DINOSAUR     PG          2006
1    ACE GOLDFINGER      G          2006
3  AFFAIR PREJUDICE      G          2006
4       AFRICAN EGG      G          2006
5      AGENT TRUMAN     PG          2006

In [165]:
# SQL
sql = '''
    select title, rating, release_year
    from film
    where (rating = 'PG' or rating = 'G') and
          (release_year = 2006 or release_year = 2007);
'''
pd.read_sql(sql, sakila_db).head()

              title rating  release_year
0  ACADEMY DINOSAUR     PG          2006
1    ACE GOLDFINGER      G          2006
2  AFFAIR PREJUDICE      G          2006
3       AFRICAN EGG      G          2006
4      AGENT TRUMAN     PG          2006

In [ ]:
# user별 매출, customer_id 
# customer, payment
# 내림차순 정렬

In [213]:
# DataFrame
sql = ''' select * from customer; '''
customer_df = pd.read_sql(sql, sakila_db)

sql = ''' select * from payment; '''
payment_df = pd.read_sql(sql, sakila_db)

In [214]:
customer_df.head(1)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [215]:
payment_df.head(1)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30

In [229]:
cu_pay_df = pd.merge(customer_df, payment_df, on = 'customer_id')

In [233]:
pd.DataFrame(cu_pay_df.groupby('customer_id')['amount'].sum()).\
    sort_values('amount', ascending = False).head()

             amount
customer_id
526          221.55
148          216.54
144          195.58
137          194.61
178          194.61

In [234]:
# SQL
sql = '''
    select c.customer_id, sum(p.amount) as total
    from customer c
         inner join payment p
         on c.customer_id = p.customer_id
    group by p.customer_id
    order by total desc;
'''

pd.read_sql(sql, sakila_db).head()

   customer_id   total
0          526  221.55
1          148  216.54
2          144  195.58
3          178  194.61
4          137  194.61